In [4]:
import pandas as pd
import numpy as np
import matplotlib as mb
import seaborn as sns

**Data Overview**

This json file from kaggle contains lists of json objects with data on individuals including:
- customer_id
- age
- gender
- annual_income (k$)
- spending_score (1-100)

Converted from csv to json using: https://csvjson.com/csv2json

In [5]:
df = pd.read_json('mall_customers.json')

In [6]:
df.head()

   Age  Annual_Income  CustomerID  Gender  Spending_Score
0   19             15           1    Male              39
1   21             15           2    Male              81
2   20             16           3  Female               6
3   23             16           4  Female              77
4   31             17           5  Female              40

In [8]:
average_income = df['Annual_Income'].mean()

In [12]:
average_income

60.56

In [13]:
#Add new column for incomes above average, which will be a boolean value

df['above_average_income'] = (df['Annual_Income'] - average_income) > 0

In [17]:
#You can review just 1 or more sample of the data to see how it looks

df.sample(5)

,Age,Annual_Income,CustomerID,Gender,Spending_Score,above_average_income
109,66,63,110,Male,48,True
193,38,113,194,Female,91,True
120,27,67,121,Male,56,True
37,30,34,38,Female,73,False
185,30,99,186,Male,97,True

In [ ]:
df.to_csv('mall_customers_i')